artillery/complex/reactive-stress-remote.yml
config:
  phases:
    - duration: 60
      arrivalRate: 4
      name: Warm up
  ensure:
    maxErrorRate: 1
    max: 500
  engines:
    playwright:
      globalTimeout: 240000
      launchOptions:
        slowMo: 500
  processor: '../../tests/complex/helpers.js'
scenarios:
  - engine: playwright
    testFunction: 'complexReactiveScenario'